ClosedShell Property
 Return the closedShell of the Room.
  Namespace:   Autodesk.Revit.DB.Architecture
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public GeometryElement ClosedShell { get; }
  Visual Basic
Public ReadOnly Property ClosedShell As GeometryElement
	Get
  Visual C++
public:
property GeometryElement^ ClosedShell {
	GeometryElement^ get ();
}
 See Also
  Room Class
  Autodesk.Revit.DB.Architecture Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →